src/cf/Catalogs/CRM_КатегорииРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_КатегорииРешений</Name>
			<Comment>Категории решений базы знаний</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_КатегорииРешений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Процедура выполняет заполнение реквизитов предопределенных элементов.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьПредопределенныеКатегорииРешений() Экспорт
	
	СправочникОбъект = Справочники.CRM_КатегорииРешений.ТекущиеПроблемы.ПолучитьОбъект();
	СправочникОбъект.ЦветИндекс			= 15;
	СправочникОбъект.ЦветПредставление 	= НСтр("ru = 'Темно-красный'");
    СправочникОбъект.ЦветКрасный  		= 214;	
	СправочникОбъект.ЦветЗеленый  		= 36; 
	СправочникОбъект.ЦветСиний  		= 48;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.CRM_КатегорииРешений.ДополнительнаяИнформация.ПолучитьОбъект();
	СправочникОбъект.ЦветИндекс			= 22;
	СправочникОбъект.ЦветПредставление 	= НСтр("ru = 'Темно-синий'");
    СправочникОбъект.ЦветКрасный  		= 52;	
	СправочникОбъект.ЦветЗеленый  		= 103; 
	СправочникОбъект.ЦветСиний  		= 184;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.CRM_КатегорииРешений.РекомендуемаяИнформация.ПолучитьОбъект();
	СправочникОбъект.ЦветИндекс			= 19;
	СправочникОбъект.ЦветПредставление 	= НСтр("ru = 'Темно-зеленый'");
    СправочникОбъект.ЦветКрасный  		= 68;	
	СправочникОбъект.ЦветЗеленый  		= 166; 
	СправочникОбъект.ЦветСиний  		= 57;
	СправочникОбъект.Записать();
	
КонецПроцедуры	// ЗаполнитьПредопределенныеКатегорииРешений()

#КонецЕсли
